In [1]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np
from numpy.random import randn

df = pd.read_clipboard()
df

   Col1  Col2  Col3  Col4  Col5  Col6
A    58    47    72    50    25    59
B    25    49    63    96    85    11
C    85    33    59    45    37    73
D    92    61    87    89    58    66
E    67     9    96    23     2    11
F    89    59    11    26     6    46

In [2]:
# Cong cac dong
df.sum()

Col1    416
Col2    258
Col3    388
Col4    329
Col5    213
Col6    266
dtype: int64

In [3]:
# Cong cac cot
df.sum(axis=1)

A    311
B    329
C    332
D    453
E    208
F    237
dtype: int64

In [4]:
df.max()

Col1    92
Col2    61
Col3    96
Col4    96
Col5    85
Col6    73
dtype: int64

In [5]:
df.idxmax()

Col1    D
Col2    D
Col3    E
Col4    B
Col5    B
Col6    C
dtype: object

In [6]:
# Cummulative Sum
df.cumsum()

   Col1  Col2  Col3  Col4  Col5  Col6
A    58    47    72    50    25    59
B    83    96   135   146   110    70
C   168   129   194   191   147   143
D   260   190   281   280   205   209
E   327   199   377   303   207   220
F   416   258   388   329   213   266

In [7]:
df

   Col1  Col2  Col3  Col4  Col5  Col6
A    58    47    72    50    25    59
B    25    49    63    96    85    11
C    85    33    59    45    37    73
D    92    61    87    89    58    66
E    67     9    96    23     2    11
F    89    59    11    26     6    46

In [8]:
df.describe()

            Col1       Col2       Col3       Col4       Col5       Col6
count   6.000000   6.000000   6.000000   6.000000   6.000000   6.000000
mean   69.333333  43.000000  64.666667  54.833333  35.500000  44.333333
std    25.476787  19.431932  29.830633  31.070350  31.816662  27.317882
min    25.000000   9.000000  11.000000  23.000000   2.000000  11.000000
25%    60.250000  36.500000  60.000000  30.750000  10.750000  19.750000
50%    76.000000  48.000000  67.500000  47.500000  31.000000  52.500000
75%    88.000000  56.500000  83.250000  79.250000  52.750000  64.250000
max    92.000000  61.000000  96.000000  96.000000  85.000000  73.000000

In [13]:
nd = np.nan
A = [1,2,3]
B = [4,nd,6]
C = [nd,8,nd]
D = [nd,nd,nd]

df1 = DataFrame([A,B,C,D])
df1

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  6.0
2  NaN  8.0  NaN
3  NaN  NaN  NaN

In [14]:
# Xoa dong co na
df1.dropna()

     0    1    2
0  1.0  2.0  3.0

In [15]:
df1.dropna(how='all')

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  6.0
2  NaN  8.0  NaN

In [16]:
df1.dropna(thresh=2)

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  6.0

In [18]:
df1.dropna(thresh=3)

     0    1    2
0  1.0  2.0  3.0

In [19]:
df1.dropna(thresh=4)

Empty DataFrame
Columns: [0, 1, 2]
Index: []

In [20]:
df1.dropna(thresh=1)

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  6.0
2  NaN  8.0  NaN

In [21]:
df1.fillna(100)

       0      1      2
0    1.0    2.0    3.0
1    4.0  100.0    6.0
2  100.0    8.0  100.0
3  100.0  100.0  100.0

In [23]:
df1.fillna(0,inplace=True)
df1

     0    1    2
0  1.0  2.0  3.0
1  4.0  0.0  6.0
2  0.0  8.0  0.0
3  0.0  0.0  0.0